app/controllers/api/v2/sessions_controller.rb

  def create
    user = User.find_by(email: sessions_params[:email])

    if user && user.valid_password?(sessions_params[:password])
      sign_in user, store: false
      user.generate_authentication_token!
      user.save
---
SELECT  `users`.* FROM `users` WHERE `users`.`email` = 'wdmeida@gmail.com' LIMIT 1
UPDATE `users` SET `current_sign_in_at` = '2017-08-02 21:47:32', `last_sign_in_at` = '2017-08-02 21:47:32', `current_sign_in_ip` = '127.0.0.1', `last_sign_in_ip` = '127.0.0.1', `sign_in_count` = 1, `updated_at` = '2017-08-02 21:47:32' WHERE `users`.`id` = 1