app/controllers/api/v2/tasks_controller.rb

SELECT  `tasks`.* FROM `tasks` WHERE `tasks`.`user_id` = 4 AND `tasks`.`id` = 3 LIMIT 1
---
      task = current_user.tasks.find(params[:id])

INSERT INTO `tasks` (`title`, `description`, `deadline`, `user_id`, `created_at`, `updated_at`) VALUES ('Estudar Angular', 'Estudar Angular para usar no nosso projeto.', '2017-08-05 14:00:00', 4, '2017-08-02 20:29:32', '2017-08-02 20:29:32')
---
    task = current_user.tasks.build(task_params)

    if task.save

SELECT  `tasks`.* FROM `tasks` WHERE `tasks`.`user_id` = 3 AND `tasks`.`id` = 1 LIMIT 1
UPDATE `tasks` SET `description` = 'Jogar Futebol amanhã no Andaraí', `deadline` = '2017-11-04 18:31:00', `updated_at` = '2017-11-03 20:31:29' WHERE `tasks`.`id` = 1
---
    task = current_user.tasks.find(params[:id])

    if task.update_attributes(task_params)

SELECT  `tasks`.* FROM `tasks` WHERE `tasks`.`user_id` = 3 AND `tasks`.`id` = 2 LIMIT 1
DELETE FROM `tasks` WHERE `tasks`.`id` = 2
---
    task = current_user.tasks.find(params[:id])
    task.destroy