app/controllers/api/v2/users_controller.rb

INSERT INTO `users` (`email`, `encrypted_password`, `created_at`, `updated_at`, `auth_token`) VALUES ('wdmeida@gmail.com', '$2a$11$RbAGD3xO3/t8NVxx8U69auRaAxietk66SmblFfGlhEmQUKkKdJKUe', '2017-08-02 21:47:23', '2017-08-02 21:47:23', 'XN-wvwvnEeafUhbMXimY')
---
  def create
    user = User.new(user_params)

    if user.save