app/controllers/api/v1/sessions_controller.rb

  def create
    user = User.find_by(email: sessions_params[:email])

    if user && user.valid_password?(sessions_params[:password])
      sign_in user, store: false
      user.generate_authentication_token!
      user.save
---
SELECT  `users`.* FROM `users` WHERE `users`.`email` = 'wdmeida@gmail.com' LIMIT 1
UPDATE `users` SET `current_sign_in_at` = '2017-08-02 17:50:28', `last_sign_in_at` = '2017-08-02 17:50:28', `current_sign_in_ip` = '10.0.2.2', `last_sign_in_ip` = '10.0.2.2', `sign_in_count` = 1, `updated_at` = '2017-08-02 17:50:28' WHERE `users`.`id` = 4

  def destroy
    user = User.find_by(auth_token: params[:id])
    user.generate_authentication_token!
    user.save
---
SELECT  `users`.* FROM `users` WHERE `users`.`auth_token` = 'K_NJyq6nidmUWkffYxYk' LIMIT 1
UPDATE `users` SET `auth_token` = 'tRzEshFYgC1xGZQCfyU2', `updated_at` = '2017-08-02 18:12:06' WHERE `users`.`id` = 4