app/controllers/api/v1/tasks_controller.rb

SELECT  `tasks`.* FROM `tasks` WHERE `tasks`.`user_id` = 4 AND `tasks`.`id` = 3 LIMIT 1
---
      task = current_user.tasks.find(params[:id])

INSERT INTO `tasks` (`title`, `description`, `deadline`, `user_id`, `created_at`, `updated_at`) VALUES ('Assistir Cowboys x Cardinals', 'Assistir jogo inícial da pré temporada da NFL.', '2017-08-03 21:00:00', 4, '2017-08-02 17:56:08', '2017-08-02 17:56:08')
---
    task = current_user.tasks.build(task_params)

    if task.save

SELECT  `tasks`.* FROM `tasks` WHERE `tasks`.`user_id` = 4 AND `tasks`.`id` = 3 LIMIT 1
UPDATE `tasks` SET `title` = 'Estudar Angular, mas de verdade, sem enrolar.', `done` = 1, `updated_at` = '2017-08-02 18:05:09' WHERE `tasks`.`id` = 3
---
    task = current_user.tasks.find(params[:id])

    if task.update_attributes(task_params)

SELECT  `tasks`.* FROM `tasks` WHERE `tasks`.`user_id` = 4 AND `tasks`.`id` = 3 LIMIT 1
DELETE FROM `tasks` WHERE `tasks`.`id` = 3
---
    task = current_user.tasks.find(params[:id])
    task.destroy