app/controllers/api/v1/users_controller.rb

    def create
        user = User.new(user_params)

        if user.save
---
INSERT INTO `users` (`email`, `encrypted_password`, `created_at`, `updated_at`, `auth_token`) VALUES ('wdmeida@gmail.com', '$2a$11$cCDC979xC2bvBcJrJTSdPuEWxKUsNcb1xEEzBI4hcJihjtRVOE8.K', '2017-08-02 17:43:30', '2017-08-02 17:43:30', 'j1WtUKPzMFEFVJ6zc5zz')

    def destroy
        user = User.find(params[:id])
        user.destroy
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 4 LIMIT 1
DELETE FROM `users` WHERE `users`.`id` = 4

    def show
        begin
            user = User.find(params[:id])
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1

    def update
        user = User.find(params[:id])

        if user.update(user_params)
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 4 LIMIT 1
UPDATE `users` SET `email` = 'joao@emaileditado.com', `updated_at` = '2017-05-11 19:11:20' WHERE `users`.`id` = 4